<!doctype html>
<html>
    <head>
        <title>TP1. HTML, CSS et JS </title>
        <meta charset="utf-8">
        <link rel="stylesheet" href="../../css/global.css">
        <meta name="keywords" content="programmation, sql, r, sas, python, mongo, nosql, html, css, javascript, d3, google charts, chart.js">
        <meta name="description" content="Page professionnelle de FX Jollois, contenant des notes de programmation, des tutoriels et des slides de cours, ainsi que des liens vers les projets GitHub personnels">
        <meta name="author" content="Francois-Xavier Jollois">
        <meta name="copyright" content="&#xA9;">
    <link rel="stylesheet" href="../../lib/highlight/styles/default.css">
</head>
    <body>
        <header><span>&#xE0; propos de <a href="../../">moi</a></span><span class="sep">|</span><span>retour &#xE0; <a href="../">webreporting</a></span></header>
        <section><h1 id="tp1htmlcssetjs">TP1. HTML, CSS et JS</h1>

<p>Premi&#xE8;re utilisation HTML, CSS et JS (<a href="http://embed.plnkr.co/7pv3ri/preview">lien vers Plnker</a>) :</p>

<ul>
<li>Vous verrez un aper&#xE7;u du rendu (<em>Preview</em>)</li>
<li>Avec l&apos;onglet <em>Code</em> (en haut &#xE0; droite), vous pouvez voir le contenu de chaque fichier</li>
<li>En cliquant sur <em>Edit</em>, vous pourrez &#xE9;diter ces fichiers et faire le travail demand&#xE9;</li>
</ul>

<h2 id="afaire">A faire</h2>

<p>Cr&#xE9;er un script permettant de faire un diagramme avec les contraintes suivantes :</p>

<ul>
<li>barres verticales, </li>
<li>largeur du graphique &#xE9;gale &#xE0; celle de la fen&#xEA;tre,</li>
<li>largeur des barres en fonction du nombre de celles-ci (et donc du nombre de modalit&#xE9;s),</li>
<li>modalit&#xE9;s affich&#xE9;es en dessous de chaque barre,</li>
<li>valeurs affich&#xE9;es au dessus de chaque barre,</li>
<li>r&#xE9;sultat fonctionnel quelque soit le nombre de modalit&#xE9;s donn&#xE9;es (tester avec
diff&#xE9;rentes valeurs)</li>
<li>changement de couleur de la barre sur laquelle passe la souris</li>
<li>gestion des plusieurs clics sur les boutons :
<ul><li>le premier clique cr&#xE9;&#xE9; et affiche le diagramme</li>
<li>le deuxi&#xE8;me le cache, sans le supprimer</li>
<li>le troisi&#xE8;me l&apos;affiche de nouveau, sans le recr&#xE9;er donc</li></ul></li>
</ul>

<p>Pour am&#xE9;liorer le graphique, on choisit de ne plus afficher directement la
valeur sur le graphique. On veut une fen&#xEA;tre <em>pop-up</em> qui s&apos;affiche lorsque la
souris passe sur une barre. Dans cette fen&#xEA;tre, on veut la modalit&#xE9; et la valeur
associ&#xE9;e. On souhaite que cette fen&#xEA;tre suive le curseur de la souris. On doit
faire attention &#xE0; l&apos;affichage si la souris est proche d&apos;un bord de la fen&#xEA;tre.</p>

<p>Pour encode am&#xE9;liorer, on souhaite r&#xE9;cup&#xE9;rer les donn&#xE9;es &#xE0; partir d&apos;un fichier
texte au format <strong>JSON</strong>, de ce type :</p>

<pre><code class="json">{
  &quot;valeurs&quot;: [12, 5, 21, 18, 14],
  &quot;modalites&quot;: [&quot;A&quot;, &quot;B&quot;, &quot;C&quot;, &quot;E&quot;, &quot;Z&quot;]
}
</code></pre></section>
        <footer></footer>
    <script src="../../lib/highlight/highlight.pack.js"></script>
<script>hljs.initHighlightingOnLoad();</script></body>
</html>